---
kind: method
id: M:Autodesk.Revit.DB.DocumentSet.ReverseIterator
source: html/46c33687-090a-858d-6849-9b6d027fede6.htm
---
# Autodesk.Revit.DB.DocumentSet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual DocumentSetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.